{
    "paragraph1": "Master’s of Applied Computer Science – Interview Assessment",
    "paragraph2": "Interview details: This interview will be used to assess your: 1. Communication skills assessment – We will assess your ability to communicate",
    "paragraph3": "an idea clearly. We understand that an interview seems like a “high stakes” situation where you are interacting with someone who is judging your ability to communicate an idea. We will be mindful of this aspect and we like to emphasize that you focus on explaining the ideas in your response clearly. Your accent, speaking styles, will not be important – we assign importance to your ability to communicate or explain an idea clearly. As the working language, i.e. the language of instruction, of the MACS program is English, all interviews will be conducted in English.",
    "paragraph4": "2. Problem-solving assessment – One of the essential aspects in computer science is problem-solving. We will assess how your problem-solving process and not necessarily the solution you achieve.",
    "paragraph5": "3. Programming skill assessment (applicants with non-Computer Science backgrounds – please check note #2) – Computer science requires you to implement your solutions to problems by writing programs, and consequently, programming skills are important for students entering the MACS program. You should expect to be asked questions on the following topics: a. Computer algorithms and data structures, b. Systems level programming and networking, c. Databases and data management, d. Software engineering and development, e. Problem solving in applied contexts, f. Programming in Java, C++, or Python, g. SQL and relational databases, and h. Unix, Windows, and other contemporary operating systems.",
    "paragraph6": "NOTE: 1. For applicants with Computer Science backgrounds - When answering the",
    "paragraph7": "questions, you may be asked to write your response using the interview tool. You will also be asked to explain what you are doing as you work on your solutions.",
    "paragraph8": "Page 1 of 3",
    "paragraph9": "Dalhousie University",
    "paragraph10": "Page 2 of 3",
    "paragraph11": "MACS",
    "paragraph12": "2. For applicants without Computer Science backgrounds - Please indicate to your",
    "paragraph13": "interviewer that you are from a non-Computer Science background. We will consider this aspect when making an admission decision.",
    "paragraph14": "Interview Rubric:",
    "paragraph15": "Your performance in the interview will be evaluated in accordance with the following rubric:",
    "paragraph16": "Strong",
    "paragraph17": "Good",
    "paragraph18": "Marginal",
    "paragraph19": "Poor",
    "paragraph20": "Unacceptable",
    "paragraph21": "Communication Effective Skills",
    "paragraph22": "communicator; displays clarity, conversation conciseness, without precise use, difficulty; makes and understanding minimal of technical terms and concepts.",
    "paragraph23": "Can hold a technical",
    "paragraph24": "errors when expressing technical terms and concepts.",
    "paragraph25": "Can hold a technical conversation with minimal need to rephrase questions and answers; displays some difficulty expressing technical terms and concepts.",
    "paragraph26": "Significant Difficult technical conversation that delay in impedes or interview prevents an progress effective due to the interview; cannot need to express technical rephrase concepts questions or effectively. answers; struggles to express technical concepts and makes frequent errors. Correctly Correctly Correctly answered answered 5 answered 7 3 or 4 or 6 or 8 questions questions questions out of 10 that out of 10 that out of 10 involve involve problem problem solving. solving.",
    "paragraph27": "Correctly answered 0, 1, or 2 questions out of 10 that involve problem solving",
    "paragraph28": "Correctly",
    "paragraph29": "that involve problem solving. Correctly performed performed 0, 1, or 3 or 4 2 tasks out of 10 tasks that use tasks out of 10 tasks your technical that use your technical skills.",
    "paragraph30": "skills.",
    "paragraph31": "Problem Solving Correctly answered 9 or in a 10 questions Computer Science Context out of 10 that",
    "paragraph32": "involve problem solving.",
    "paragraph33": "Technical Computing Skills",
    "paragraph34": "Correctly Correctly performed 7 answered 9 or or 8 tasks 10 tasks out of out of 10 10 tasks that use your tasks that technical skills. use your technical skills.",
    "paragraph35": "Correctly performed 5 or 6 tasks out of 10 tasks that use your technical skills.",
    "paragraph36": "Dalhousie University",
    "paragraph37": "Page 3 of 3",
    "paragraph38": "MACS",
    "paragraph39": "Tips/help to prepare for your interview:",
    "paragraph40": "Preparing for and participating in an interview may seem like a stressful experience. However, remember that we are using the information we gather to support your application. You may want to refer to the following links to help you prepare for your interview:",
    "paragraph41": "response-technique-2061629",
    "paragraph42": "competency-based-interview",
    "paragraph43": "These links give you an idea of the kind of responses expected from the interview. The framework discussed in these links (i.e. STAR framework) helps structure your responses to questions in a way that the central concept of your response is well- structured.",
    "paragraph44": "We would also recommend that you take a look at videos and resources from the following link to get a good understanding of how to navigate an interview: https://www.norquest.ca/research-innovation/colbourne-institute-for-inclusive- leadership/projects/completed-projects/navigating-the-interview.aspx",
    "paragraph45": "Culture of Respect:",
    "paragraph46": "Every person at Dalhousie has a right to be respected and safe. Disrespectful behaviour in our classrooms, on our campus, on social media, and in our community, is unacceptable. Please be respectful in your interactions during the interview. For more information and for the policies that apply, please see this link: https://www.dal.ca/cultureofrespect.html",
    "paragraph47": "If you have any other questions about the interviews, please contact graduate@cs.dal.ca",
    "paragraph48": "All the best."
}